In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
%matplotlib inline
pd.options.display.float_format = "{:,.2f}".format

In [2]:
df=pd.read_csv(r"D:\Machine Learning\Projects\Real estate\Dataset\Bengaluru_House_Data.csv")
df.head()

,area_type,availability,location,size,society,total_sqft,bath,balcony,price
0,Super built-up Area,19-Dec,Electronic City Phase II,2 BHK,Coomee,1056,2.00,1.00,39.07
1,Plot Area,Ready To Move,Chikka Tirupathi,4 Bedroom,Theanmp,2600,5.00,3.00,120.00
2,Built-up Area,Ready To Move,Uttarahalli,3 BHK,NaN,1440,2.00,3.00,62.00
3,Super built-up Area,Ready To Move,Lingadheeranahalli,3 BHK,Soiewre,1521,3.00,1.00,95.00
4,Super built-up Area,Ready To Move,Kothanur,2 BHK,NaN,1200,2.00,1.00,51.00

In [3]:
df.shape

(13320, 9)

In [4]:
## Dropping Unwanted columns

df1=df.drop(["area_type","availability","society","balcony"],axis=1)
df1.head()

                   location       size total_sqft  bath  price
0  Electronic City Phase II      2 BHK       1056  2.00  39.07
1          Chikka Tirupathi  4 Bedroom       2600  5.00 120.00
2               Uttarahalli      3 BHK       1440  2.00  62.00
3        Lingadheeranahalli      3 BHK       1521  3.00  95.00
4                  Kothanur      2 BHK       1200  2.00  51.00

**Data Cleaning**

In [5]:
df1.isnull().sum()

location       1
size          16
total_sqft     0
bath          73
price          0
dtype: int64

In [6]:
## as null values are very less dropping null values
df2=df1.dropna()
df2.isnull().sum()

location      0
size          0
total_sqft    0
bath          0
price         0
dtype: int64

In [7]:
df2['size'].unique()

array(['2 BHK', '4 Bedroom', '3 BHK', '4 BHK', '6 Bedroom', '3 Bedroom',
       '1 BHK', '1 RK', '1 Bedroom', '8 Bedroom', '2 Bedroom',
       '7 Bedroom', '5 BHK', '7 BHK', '6 BHK', '5 Bedroom', '11 BHK',
       '9 BHK', '9 Bedroom', '27 BHK', '10 Bedroom', '11 Bedroom',
       '10 BHK', '19 BHK', '16 BHK', '43 Bedroom', '14 BHK', '8 BHK',
       '12 Bedroom', '13 BHK', '18 Bedroom'], dtype=object)

In [8]:
df2['bhk']=df2['size'].apply(lambda row : int(row.split()[0]) )
df2=df2.drop(["size"],axis=1)
df2.head()

C:\Users\shiva\AppData\Local\Temp/ipykernel_7972/3346796118.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df2['bhk']=df2['size'].apply(lambda row : int(row.split()[0]) )

                   location total_sqft  bath  price  bhk
0  Electronic City Phase II       1056  2.00  39.07    2
1          Chikka Tirupathi       2600  5.00 120.00    4
2               Uttarahalli       1440  2.00  62.00    3
3        Lingadheeranahalli       1521  3.00  95.00    3
4                  Kothanur       1200  2.00  51.00    2

In [9]:
df2.bhk.unique()

array([ 2,  4,  3,  6,  1,  8,  7,  5, 11,  9, 27, 10, 19, 16, 43, 14, 12,
       13, 18], dtype=int64)

In [10]:
df2.query("bhk >20")

                       location total_sqft  bath  price  bhk
1718  2Electronic City Phase II       8000 27.00 230.00   27
4684                Munnekollal       2400 40.00 660.00   43

In [11]:
df2.total_sqft.unique()

array(['1056', '2600', '1440', ..., '1133 - 1384', '774', '4689'],
      dtype=object)

There is a range in total sqft , we convert range into mean value

In [12]:
def is_float(x):
    try:
        float(x)
    except:
        return False
    return True

In [13]:
df2[~df2.total_sqft.apply(is_float)].head(10)

               location      total_sqft  bath  price  bhk
30            Yelahanka     2100 - 2850  4.00 186.00    4
122              Hebbal     3067 - 8156  4.00 477.00    4
137  8th Phase JP Nagar     1042 - 1105  2.00  54.01    2
165            Sarjapur     1145 - 1340  2.00  43.49    2
188            KR Puram     1015 - 1540  2.00  56.80    2
410             Kengeri  34.46Sq. Meter  1.00  18.50    1
549         Hennur Road     1195 - 1440  2.00  63.77    2
648             Arekere       4125Perch  9.00 265.00    9
661           Yelahanka     1120 - 1145  2.00  48.13    2
672        Bettahalsoor     3090 - 5002  4.00 445.00    4

In [14]:
def mean_range(x):
    mean_list=x.split("-")
    if len(mean_list)==2:
        mean_value=(float(mean_list[0])+float(mean_list[1]))/2
        return mean_value
    try :
        return(float(x))
    except :
        return x

In [15]:
df2.total_sqft=df2.total_sqft.apply(mean_range)

In [16]:
df2[~df2.total_sqft.apply(is_float)].total_sqft

410       34.46Sq. Meter
648            4125Perch
775        1000Sq. Meter
872        1100Sq. Yards
1019           5.31Acres
1086             30Acres
1400        716Sq. Meter
1712       1500Sq. Meter
1743     142.61Sq. Meter
1821       1574Sq. Yards
2310     361.33Sq. Yards
2881        117Sq. Yards
3228       3040Sq. Meter
3285        500Sq. Yards
4113        167Sq. Meter
4293        315Sq. Yards
5453              3Cents
5537     188.89Sq. Yards
5631        204Sq. Meter
5668         45Sq. Yards
5708      133.3Sq. Yards
5976      78.03Sq. Meter
6268        122Sq. Yards
6303      84.53Sq. Meter
6333           2.09Acres
6552            24Guntha
6592        697Sq. Meter
6953     142.61Sq. Meter
7001           1500Cents
7248        132Sq. Yards
7334              2Acres
7520       1100Sq. Meter
7607             15Acres
7726           1.26Acres
8273     151.11Sq. Yards
9423            1Grounds
9519       2940Sq. Yards
9734      45.06Sq. Meter
10488          1.25Acres
10491     86.72Sq. Meter
11320           38Guntha
11615             6Acres
12186       120Sq. Yards
12252        24Sq. Meter
12560    142.84Sq. Meter
12652       300Sq. Yards
Name: total_sqft, dtype: object

In [17]:
df2[~df2.total_sqft.apply(is_float)]
df3=pd.DataFrame()
df3[['number', 'text']] = df2[~df2.total_sqft.apply(is_float)].total_sqft.str.extract(r'([0-9,.]+)(\D+)')
df3.reset_index(drop=True,inplace=True)
df3.number=df3.number.astype("float")
df3.head()

    number       text
0    34.46  Sq. Meter
1 4,125.00      Perch
2 1,000.00  Sq. Meter
3 1,100.00  Sq. Yards
4     5.31      Acres

In [20]:
df3.text.value_counts()

Sq. Meter    17
Sq. Yards    15
Acres         8
Cents         2
Guntha        2
Perch         1
Grounds       1
Name: text, dtype: int64

In [18]:
# Conversion factor dictionary
conversion_factors = {
    'Sq. Meter': 10.7639,  # 1 square meter = 10.7639 square feet
     'Perch':272.25,       # 1 Perch = 272.25 square feet
    'Acres': 43560,        # 1 acre = 43560 square feet
    'Sq. Yards': 9,        # 1 square yard = 9 square feet
    'Cents': 435.6,        # 1 cent = 435.6 square feet
    'Guntha': 1089,         # 1 guntha = 1089 square feet
    'Grounds':2400.35       # 1 guntha = 2400.35 square feet1 Square Feet
}

# Convert units to square feet
df3['area_sqft'] = df3.apply(lambda row: row['number'] * conversion_factors[row['text']], axis=1)


# Display the result
df3

KeyError: 'Perch'

In [ ]:
df2.loc[~df2.total_sqft.apply(is_float),"total_sqft"]=df3.area_sqft

In [ ]:
df2.total_sqft

#### Data Cleaning in total_sqft column
In column total sqft has range values , we have converted range values to float by taking mean of float <br>
We have values with different units , we have converted diff area units to sqft

### Derived Metrics

Making a new column price per sqft <br>
price is in lakhs coverting price per sqft in normal value by multiplying with 100000

In [ ]:
df2["price_per_sqft"]=df2["price"]*100000/df2["total_sqft"]
df2

In [ ]:
## Location column
df2.location.value_counts()

In [ ]:
location_stats=df2.groupby("location").location.agg("count").sort_values(ascending=False)
location_less_than_10=location_stats[location_stats<=10]

There are 1265 unique values in location column , Renamed value with others if count is <=10

In [ ]:
# Rename location to others if count is <=10

df2.location=df2.location.apply(lambda row : "other" if row in location_less_than_10 else row)
df2.location.value_counts()

In [ ]:
#Remove data if sqft per bedroom is less than 300 (As per domain expert)
df2=df2[~(df2.total_sqft/df2.bhk<300)]
df2

In [ ]:
 def remove_outliers(df):   
    for key,subdf in df.groupby("location"):
        dfout=pd.DataFrame()
        # Calculate mean and standard deviation
        m=np.mean(subdf.price_per_sqft)
        sd=np.std(subdf.price_per_sqft)
        # Define lower bond & updder bond
        lower_bond=m-sd
        upper_bond=m+sd
        reduced_df=subdf[(subdf.price_per_sqft>lower_bond) & (subdf.price_per_sqft<=upper_bond)]
        dfout=pd.concat([df5,reduced_df],ignore_index=True)
    return dfout

In [ ]:
df5=remove_outliers(df2)
df5